app/controllers/api/events_controller.rb

SELECT "events".* FROM "events"
---
    def index
        @events = Event.all.includes(:host)